Tekla Open API Reference for Tekla Structures 2025
MaterialMarketSizesItemEnumerator.Current Property
 Returns a MaterialMarketSizesItem instance with the current index.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public MaterialMarketSizesItem Current { get; }
Public ReadOnly Property Current As MaterialMarketSizesItem
	Get
Property Value
Type: MaterialMarketSizesItem
Exceptions
Exception | Condition
InvalidOperationException | Thrown when Current item cannot be accessed from the given location.
See Also
Reference
MaterialMarketSizesItemEnumerator Class
Tekla.Structures.Catalogs Namespace